{
    "version": "0.6",
    "pageContent":
	{
        "_comments": "JSON object that contains data for page labels, buttons, etc.",
        "navItems":
		{
            "_common":
      			{
                "buttonBackToGallery":
        				{
                    "name": "Back To Gallery",
          					"method": "backToGallery()",
          					"idName": "backToGallery"
                },
                "buttonStartTutorial":
        				{
                    "name": "Start Tutorial",
          					"method": "startTutorialFromDetailsScreen()",
          					"idName": "startTutorial"
                },
        				"buttonViewDetails":
        				{
                    "name": "View Details",
          					"method": "viewDetails()",
          					"idName": "stepsViewDetails"
                }
            }
        }
    },
    "tutorial":
  	{
        "_common":
    		{
            "name": "Policy Projects and Policies",
            "shortDescription": "Learn how create a policy and deploy one to an Integration Server.",
            "durationText": "This tutorial takes approximately",
            "durationTime": "15 minutes",
            "_resourceToOpenComment": "The ID of the first resource to open when the user imports the tutorial. Resource IDs are defined in the repo_metadata.json Tutorials listing on ot4i.",
            "resourceToOpen": "EventRoutingFlow",
            "helpLink":
      			{
                "text": "IBM Knowledge Center",
                "link": "/com.ibm.etools.msgbroker.helphome.doc/help_home_msgbroker.htm"
            }
        },
        "pageDetails":
    		{
            "topicsName": "Tutorial Topics",
            "_topicListComment": "A short list of product concepts or tasks demonstrated by this tutorial",
            "topicList":
      			[
                {
                    "title": "Creating a Policy Project"
                },
                {
                    "title": "Creating a Policy within a Policy Project"
                },
                {
                    "title": "Configuring a simple Policy"
                },
                {
                    "title": "Deploying and seeing the effects of a Policy"
                }
            ],
            "outcomesName": "Learning outcomes",
            "_outcomesComment": "A description of what the user will have learned or accomplished by running this tutorial.",
            "outcomeList":
      			[
                {
                    "title": "Understand how to create a Policy within a Policy Project, configure it and then build it into a Bar file for deployment."
                }
            ],
            "summary":
      			{
                "overviewName": "OVERVIEW",
                "_overviewComment": "A short description of what happens in this tutorial, and an optional short explanation of the ACE concepts used in this tutorial if necessary for context. What background knowledge must the user have for this to make sense?",
                "sections":
        				[
                    {
                        "section": "This tutorial shows how a user would go about creating a simple Policy within a Policy Project. The example will guide the user to create an Activity Log Policy to be deployed with a simple flow."
                    },
                    {
                        "section": "The user will configure the Policy to report any activity assosciated with the deployed flow, directly to a specified file saved locally."
                    },
                    {
                        "section": "Policies are a way to alter the behaviour of, or implement extra functionality to, a deployed flows on an Integration Server. They are a brand new addition to ACE as of V11 and are designed to make managing servers more easy to understand and implement."
                    }
                ]
            }
        },
        "pageSteps":
    		{
            "create":
      			{
                "overview":
        				{
                    "name": "Create",
                    "heading": "Import projects",
                    "_createComment": "A description of what will happen when the user clicks Import.",
                    "sections":
          					[
                        {
                            "section": "Click <span class='uicontrol'>Import</span> and the <span class='application'>SimpleApp</span> application along with a Policy Project, <span class='application'>Policies</span> will both be imported to your workspace."
                        },
                  			{
                  			    "section": "This simple application contains a single messageflow which listens and replies over HTTP. Once we have created our Policy we will build both that and the message flow into a Bar file ready for deployment."
                  			}
                    ]
                },
                "actions":
        				{
                    "title": "Create Actions",
                    "details":
          					[
                        {
                            "name": "Import",
                            "method": "importArtifacts()"
                        }
                    ]
                }
            },
            "prepare":
      			{
                "overview":
        				{
                    "name": "Prepare",
                    "heading": "Prepare an Integration Server",
                    "_prepareComment": "Enable resource statistics tracking:",
                    "sections":
          					[
                      {
                        "steps":
                        {
                          "type": "ordered",
                          "details":
                          [
                            {
                                "details": "Assuming you are using a Windows platform, open an App Connect Enterprise Command Console and run the following command: <br><code>mqsicreateworkdir C:\\MyServer</code><br> where <b>C:\\MyServer</b> will the working directory for your Integration Server."
                            },
                            {
                                "details": "Right-Click on the Policy Project in the Application Development tab and create a new Policy. Call it ActivityLogPolicy and click 'Finish'"
                            },
                            {
                                "details": "Open the new policy for configuring and change the Type to Activity Log. After a brief moment the table below should populate with various fields. Find the 'File name' field and set the value to <b>C:\\MyServer\\activityLog.txt<b>"
                            },
                            {
                                "details": "<code>Ctrl+s</code> to save the Policy and then create a Bar file in the Application Development tab by right clicking and selecting 'BAR file'. Call it MyBar and click 'Finish' it."
                            },
                            {
                                "details": "To build the newly created Policy into the BAR file:<br> - Select the Applications radio button and tick the 'ExampleApp' application<br> - Select the Policies radio button and do the same for the 'Policies' Policy Project<br> - Click 'Build and Save' to generate the BAR file."
                            },
                            {
                                "details": "Start up your Integration Server by typing the following command into the ACE Command Console:<br><code>IntegrationServer --name MyServer --work-dir C:\\MyServer</code><br>"
                            },
                            {
                                "details": "Deploy the MyBar.bar file to your Integration Server after making a connection to it within the toolkit."
                            }
                          ]
                        }
                      }
                    ]
                },
                "actions":
        				{
                    "title": "Prepare Actions",
                    "details":
          					[
                        {
                            "name": "Deploy",
                            "method": "deployArtifacts()"
                        }
                    ]
                }
            },
            "run":
      			{
                "overview":
        				{
                    "name": "Run",
                    "heading": "Follow these steps to complete the tutorial",
                    "_runComment": "The full steps for the user to run through the tutorial. Use 'sections' to render paragraphs, 'steps' with a type of 'ordered' or 'unordered' to render HTML lists, and 'substeps' to render nested lists.",
                    "sections":
          					[
                        {
                            "section": "Follow the following steps to complete the tutorial.",
                            "steps":
              							{
                                "type": "ordered",
                                "details":
                								[
                                    {
                                        "details": "Navigate to a Command Prompt and run this command a handful of times:<br><code>curl -X POST http://localhost:7800/request -d HelloWorld</code>"
                                    },
                                    {
                                        "details": "Navigate to your server's working directory:<br>code>C:\\MyServer</code> in this example."
                                    },
                                    {
                                        "details": "You should see a text file with the same name you specified in the ActivityLogPolicy, activityLog.txt in this example."
                        				    },
                        				    {
                                        "details": "Open this file in your preferred text editor and you should see various logs with fields seperated by commas. Each log corresponds to your curl requests made previously."
                        				    },
                        				    {
                                        "details": "As you can see the Policy we've created and deployed throughout this tutorial has added some useful functionality to our Integration Server, one of many more sophisticated possibilities provided by ACE."
                        				    }
                                ]
                            }
                        }
                    ]
                },
				"exits":
				{
					"title": "Run Exits",
					"details":
					[
						{
							"name": "Clean Up",
							"description": "Clean up and remove any changes in your workspace made by the tutorial.",
							"method": "cleanUp()"
						}
					]
				}
            }
        }
    }
}
